In [1]:
person = {
    "firstName" : "Corey",
    "lastName" : "Schafer",
    "email" : "CoreySchafer@gmail.com"
}

In [2]:
people = {
    "firstName" : ["Corey"],
    "lastName" : ["Schafer"],
    "email" : ["CoreySchafer@gmail.com"]
}

In [2]:
people = {
    "firstName" : ["Corey","Jane","John"],
    "lastName" : ["Schafer", 'Doe', 'Doe'],
    "email" : ["CoreyMSchafer@gmail.com",'JaneDoe@gmail.com','JohnDoe@gmail.com']
}

In [4]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']

In [4]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [8]:
# 0 1 2 is default index column without name(heading)
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [8]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [9]:
df["email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [10]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [11]:
type(df['email'])

pandas.core.series.Series

In [12]:
# dataframe has method called count and you have column name as count then . notation going to access count method instead of count column.
# that time you have you use df['count'] - to access column name.

In [13]:
# Multiple columns - set of inner bracket as set of list.
# if you can't leave inner brackets because you will get keyError and pandas think that you are passing both of string as column name.
df[['lastName','email']]

  lastName                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@gmail.com
2      Doe        JohnDoe@gmail.com

In [14]:
df.columns

Index(['firstName', 'lastName', 'email'], dtype='object')

In [15]:
# get row
#iloc- access the rows by integer location 
df.iloc[0]

firstName                      Corey
lastName                     Schafer
email        CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [16]:
# multiple rows - integer locations
df.iloc[[0,1]]

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com

In [17]:
# grab email column and its third column so 2.
df.iloc[[0,1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [18]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [19]:
df.loc[0]

firstName                      Corey
lastName                     Schafer
email        CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [20]:
#loc - labels
df.loc[[0,1]]

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com

In [21]:
# emanil column
df.loc[[0,1],['email','lastName']]

                     email lastName
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@gmail.com      Doe

In [22]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

# Index

In [24]:
df.set_index('email')

                        firstName lastName
email
CoreyMSchafer@gmail.com     Corey  Schafer
JaneDoe@gmail.com            Jane      Doe
JohnDoe@gmail.com            John      Doe

In [25]:
df.set_index('email', inplace=True)

In [26]:
df

                        firstName lastName
email
CoreyMSchafer@gmail.com     Corey  Schafer
JaneDoe@gmail.com            Jane      Doe
JohnDoe@gmail.com            John      Doe

In [27]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'], dtype='object', name='email')

In [28]:
df.loc['CoreyMSchafer@gmail.com']

firstName      Corey
lastName     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [57]:
df.loc['CoreyMSchafer@gmail.com','lastName']

'Schafer'

In [59]:
df.loc[0]

KeyError: 0

In [61]:
# if you wanna use integer location instead of labels then use iloc
df.iloc[0]

firstName      Corey
lastName     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [67]:
df.reset_index(inplace=False)

   index                    email firstName lastName
0      0  CoreyMSchafer@gmail.com     Corey  Schafer
1      1        JaneDoe@gmail.com      Jane      Doe
2      2        JohnDoe@gmail.com      John      Doe

In [71]:
df.reset_index(inplace=True)

In [73]:
df

   index                    email firstName lastName
0      0  CoreyMSchafer@gmail.com     Corey  Schafer
1      1        JaneDoe@gmail.com      Jane      Doe
2      2        JohnDoe@gmail.com      John      Doe

# Filtering - Using Conditionals to Filter Rows and Columns

In [13]:
import pandas as pd

In [15]:
df = pd.DataFrame(people)

In [17]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [23]:
df['lastName'] == 'Doe'  # it gives in serious object & true values that meet with our filter criteria & false - didn't met in DataFrame.

0    False
1     True
2     True
Name: lastName, dtype: bool

In [27]:
filt = df['lastName'] == 'Doe' 
# flit = (df['lastName'] == 'Doe') same as above, () added coz too identify assign

In [29]:
# apply this filter to DataFrame
df[flit] # got only filtered data or
# df[df['lastName'] == 'Doe']

  firstName lastName              email
1      Jane      Doe  JaneDoe@gmail.com
2      John      Doe  JohnDoe@gmail.com

In [33]:
# .loc - use yto look rows and columns
df.loc[filt]

  firstName lastName              email
1      Jane      Doe  JaneDoe@gmail.com
2      John      Doe  JohnDoe@gmail.com

In [35]:
# first value of .loc are the rows we want and the second values here are the columns we want.
df.loc[filt,'email']

1    JaneDoe@gmail.com
2    JohnDoe@gmail.com
Name: email, dtype: object

In [37]:
# and operator & 
# or operator |

In [39]:
filt = (df['lastName'] == 'Doe') & (df['firstName'] == 'John')

In [41]:
df.loc[filt, 'email']

2    JohnDoe@gmail.com
Name: email, dtype: object

In [43]:
filt = (df['lastName'] == 'Schafer') | (df['firstName'] == 'John')

In [45]:
df.loc[filt,'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [49]:
# ~ use for neglect i.e. gives opposite result
df.loc[~filt,'email']

1    JaneDoe@gmail.com
Name: email, dtype: object

# Updating Rows and Columns - Modifying Data Within DataFrames

In [9]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [9]:
# columns
df.columns

Index(['firstName', 'lastName', 'email'], dtype='object')

In [11]:
# change the columns name
df.columns = ['first_name', 'last_name','email']

In [13]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [15]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [17]:
# list compenhension - used when you want to change column names(all column names in lower case and you want that in upper case or vice versa)
# column name contains space and you want to repalce the spaces with underscore 

df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [19]:
# replace spaces
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [21]:
df.columns = [x.lower() for x in df.columns]

In [23]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [25]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [27]:
# rename method - want to change some columns
df.rename(columns={'first_name':'first', 'last_name' : 'last'})

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [29]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [31]:
df.rename(columns={'first_name': 'first', 'last_name' : 'last'}, inplace = True)

In [33]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [35]:
# update data in row

In [37]:
# update single value

df.loc[2]

first                 John
last                   Doe
email    JohnDoe@gmail.com
Name: 2, dtype: object

In [39]:
# change lastName Doe to smith - there are couple way to do 
# 1) we can just pass in all of the new values for this row by passing in a list

df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [41]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith      JohnSmith@email.com

In [43]:
# 2) using loc

# .loc and i can pass in 2 for the rows then we can also pass the list as the second value here for the columns that we want 

df.loc[2, ['last','email']]

last                   Smith
email    JohnSmith@email.com
Name: 2, dtype: object

In [45]:
df.loc[2 , ['last' ,'email']] = ['Doe', 'JohnDoe@gmail.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [47]:
# want to change single column single value

df.loc[2, 'last'] = 'Smith'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [49]:
# .at - changing or looking up a single value
# just a single value then instaed of using .loc then i could use .at

df.at[2,'last'] = 'Doe'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [51]:
# common mistake

#

In [53]:
filt = (df['email'] == 'JohnDoe@gmail.com')
df[filt]

  first last              email
2  John  Doe  JohnDoe@gmail.com

In [55]:
df[filt]['last']

2    Doe
Name: last, dtype: object

In [57]:
df[filt]['last'] = 'Smith'

C:\Users\ssaja\AppData\Local\Temp\ipykernel_21600\662645475.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [59]:
# got SettingWithCopyWarning : because the way that we are doing here it requires multiple operations in the background which 
# can determine whether pandas returns a view or copy of our data frame so when our value isn't getting set beacause its getting set a temporary object
# thats just getting tossed out immediately after so pandas does a lot better job of explanning  this a specific warning

In [61]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [63]:
filt = (df['email'] == 'JohnDoe@gmail.com')
df.loc[filt, 'last'] = 'Smith'

In [65]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [67]:
# change - multiple columns
# email addresses which are lowercase 

# to return email in lowercase 
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@gmail.com
2          johndoe@gmail.com
Name: email, dtype: object

In [69]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [71]:
df['email'] = df['email'].str.lower()

In [73]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [75]:
# apply
# map
# applymap
# replace

In [77]:
# apply on series

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [81]:
def update_email(email):
    return email.upper()

In [83]:
# lets apply this function to our email column
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [87]:
# it won;t actually change our values so to do that we can assign this to that column
df['email'] = df['email'].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [89]:
# lamda function
df['email'] = df['email'].apply(lambda x: x.lower() )
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [91]:
# this is how it apllies on series object. so far we've only been using df['email'] with series so anytime we access a column like this that returns a 
# series and again when we apply on the series it ran a functionon all of the values in that series. 
# now when we run apply on a dataframe  it runs a function on each row or column of that dataframe

df['email'].apply(len)

#this gave us was length of each value in that email series so you might think that you can run this same apply method on entire data frame and it give 
# us the length of each value in the data frame but that's not what it does

0    23
1    17
2    17
Name: email, dtype: int64

In [95]:
# on dataframe
df.apply(len)
# its not applying the length function to every value in the dataframe its actually applying the length function to each series in the data frame
# specifically the columns so basically what this is telling us that our firstname column has a length of 3 so if we look up here at first we can see
# that first has three values its telling us taht last has 3 values and email has 3 values.
# so thats just the number of rows in each column and we can get that same result for a specific series if we manually check the length of one of those 
# so

first    3
last     3
email    3
dtype: int64

In [99]:
len(df['email'])

3

In [103]:
# you can use this apply to rows as well if you change the axis so we can change the axis here
#df.apply(len, axis='rows') # rows is default
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [105]:
# grab minimum value for each column 
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [107]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [111]:
# running apply on a Series applies function to every value in the series and running apply to a data frame like we did here
# applies a function to every series in the data frame but you might be wondering if there's a way that we can apply a function to 
# every individual element in the data frame and thats what apply map is used for. an apply map only works on data frames 
# series objects don't have the apply map method

In [113]:
# apply map
df.applymap(len)

C:\Users\ssaja\AppData\Local\Temp\ipykernel_21600\2652073246.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [117]:
# if i want to be all in lower case
df.applymap(str.lower)
# if you have numeric data then it will show error, need to pass more complicated function which handles properly

C:\Users\ssaja\AppData\Local\Temp\ipykernel_21600\1769877873.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@gmail.com
2   john    smith        johndoe@gmail.com

In [119]:
# map method - only works on Series 
# used for substituting each value in series with another value 
# substitute a couple of our first name
df['first'].map({'corey':'Chris','Jane' : 'Mary'}) # c small

0     NaN
1    Mary
2     NaN
Name: first, dtype: object

In [123]:
df['first'].map({'Corey':'Chris','Jane' : 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [125]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [127]:
# if i want to john and substitute other names then instead using map use replace method
df['first'].replace({'Corey':'Chris','Jane' : 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [129]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [131]:
df['first'] = df['first'].replace({'Corey':'Chris','Jane' : 'Mary'})

In [133]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

# Add/Remove Rows and Columns From DataFrames

In [9]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [57]:
# adding new columns
# combine first and last 
df['firstName'] + ' ' + df['lastName']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [59]:
df['full_name'] = df['firstName'] + ' ' + df['lastName']

In [61]:
df
# you can also create a new column using the apply method. 
# you can't use dot notation when assigning a column like this.we have use brackets.

  firstName lastName                    email      full_name
0     Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1      Jane      Doe        JaneDoe@gmail.com       Jane Doe
2      John      Doe        JohnDoe@gmail.com       John Doe

In [63]:
# removing column
df.drop(columns=['firstName','lastName'])

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [65]:
df.drop(columns=['firstName','lastName'], inplace = True)

In [67]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [69]:
# reverse that process that spilt that full anme column into different columns
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [71]:
# split method is that we get the first name and last name in a list.
# first name is the first value and last name is second value
# if we want to assign these to two diffrent columns then we need to expand this list so that they're actually in
# two different columns 
# we can use expand argument
df['full_name'].str.split(' ', expand= True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [73]:
# set two columns in our dataframe 
df[['first','last']] = df['full_name'].str.split(' ', expand= True)

In [75]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [77]:
# add and remove the data

In [79]:
df._append({'first':'Tony'})
# get an error because this currently doesn't have an index now.

TypeError: Can only append a dict if ignore_index=True

In [81]:
df._append({'first':'Tony'}, ignore_index= True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [83]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [85]:
people = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Rogers'],
    'email' : ['IronMan@avenge.com','Cap@avenge.com']}
df2 = pd.DataFrame(people)

In [87]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [89]:
df._append(df2)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
0       IronMan@avenge.com            NaN   Tony    Stark
1           Cap@avenge.com            NaN  Steve   Rogers

In [97]:
df._append(df2, ignore_index = True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [99]:
df._append(df2, ignore_index = True, sort= False)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [101]:
# we don't have inplace method - just set the dataframe
df = df._append(df2, ignore_index = True, sort= False)

In [103]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [105]:
df.drop(index = 4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [107]:
df.drop(index= df[df['last'] == 'Doe'].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [109]:
# or

In [111]:
filt = df['last'] == 'Doe'
df.drop(index= df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

# Sorting Data

In [118]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [122]:
df.sort_values(by='lastName')

  firstName lastName                    email
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com
0     Corey  Schafer  CoreyMSchafer@gmail.com

In [124]:
df.sort_values(by='lastName', ascending = False)

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [134]:
people = {
    "firstName" : ["Corey","Jane","John",'Adam'],
    "lastName" : ["Schafer", 'Doe', 'Doe', 'Doe'],
    "email" : ["CoreyMSchafer@gmail.com",'JaneDoe@gmail.com','JohnDoe@gmail.com','A@email.com']
}

In [136]:
df=pd.DataFrame(people)

In [138]:
df.sort_values(by=['lastName','firstName'], ascending = False)

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
2      John      Doe        JohnDoe@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
3      Adam      Doe              A@email.com

In [140]:
df.sort_values(by=['lastName','firstName'], ascending = [False, True])

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
3      Adam      Doe              A@email.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [142]:
df.sort_values(by=['lastName','firstName'], ascending = [False, True], inplace= True)

In [144]:
df

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
3      Adam      Doe              A@email.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com

In [146]:
df.sort_index()

  firstName lastName                    email
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@gmail.com
2      John      Doe        JohnDoe@gmail.com
3      Adam      Doe              A@email.com

In [148]:
df['lastName'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: lastName, dtype: object

# Cleaning Data - Casting Datatypes and Handling Missing Values

In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [9]:
# how to drop missing values

In [15]:
df.dropna() 
# got 4 rows 
# You're seeing the row with 'NA', 'Missing', etc. not being dropped because pandas.DataFrame.dropna() only removes rows that contain actual missing values, i.e., np.nan or None. 
# It does not treat strings like 'NA' or 'Missing' as missing values  these are just regular strings.

#NA	Missing	NA	Missing
# These are strings  not np.nan or None  so dropna() doesn't consider them missing.

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [13]:
# dropna() has default arguments : 
# axis: can be set either index or columns, that is gonna tell pandas we gonna drop na values when our rows are missing values when its set here to index if we set this 
# to columns then it would instead drop columns if they had missing values

# how: this is the criteria that it uses for dropping a row or columnso by default this is set to any 

#axis='index' (or axis=0): Look at rows.

#how='any': Drop the row if any column in that row has a missing value (NaN or None).

#You can also use how='all' to drop rows only if all values in the row are missing.


df.dropna(axis = 'index', how='any')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [17]:
#how='all' to drop rows only if all values in the row are missing.
df.dropna(axis='index', how="all")

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [19]:
df.dropna(axis='columns', how="all")

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [21]:
df.dropna(axis='index', how="any", subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [23]:
# as long as email and lastname is there, then it shouldn't drop those rows 
df.dropna(axis='index', how="all", subset=['last','email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [25]:
# custom missing value(row 6)

In [27]:
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace = True)

In [29]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [31]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [33]:
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [35]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [37]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [39]:
# convert column into int
df['age']= df['age'].astype(int)

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'NoneType'

In [41]:
df['age']= df['age'].astype(float)

In [45]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [47]:
df['age'].mean()

46.75